www/codeigniter4/app/Controllers/Categorias.php

    public function index(): string
    {
        $data['title'] = 'Categorias';
        $data['categorias'] = $this->categorias->findAll();
---
SELECT *
FROM `categorias`
WHERE `categorias`.`deleted_at` IS NULL