www/codeigniter4/app/Controllers/Cidades.php

SELECT *
FROM `cidades`
WHERE `cidades`.`deleted_at` IS NULL
---
    public function index(): string
    {
        $data['title'] = 'Cidades';
        $data['cidades'] = $this->cidades->findAll();