www/codeigniter4/app/Controllers/Clientes.php

    public function index(): string
    {
        $data['title'] = 'Clientes';
        $data['clientes'] = $this->clientes
            ->select('clientes.*, usuarios.usuarios_nome, usuarios.usuarios_sobrenome, usuarios.usuarios_cpf')
            ->join('usuarios', 'clientes.clientes_usuarios_id = usuarios.usuarios_id')
            ->findAll();
---
SELECT `clientes`.*, `usuarios`.`usuarios_nome`, `usuarios`.`usuarios_sobrenome`, `usuarios`.`usuarios_cpf`
FROM `clientes`
JOIN `usuarios` ON `clientes`.`clientes_usuarios_id` = `usuarios`.`usuarios_id`
WHERE `clientes`.`deleted_at` IS NULL