www/codeigniter4/app/Controllers/Enderecos.php

SELECT *
FROM `enderecos`
JOIN `cidades` ON `enderecos_cidades_id` = `cidades_id`
WHERE `enderecos`.`deleted_at` IS NULL
---
    public function index(): string
    {
        $data['title'] = 'Enderecos';
        $data['enderecos'] = $this->enderecos->join('cidades', 'enderecos_cidades_id = cidades_id')->find();

SELECT *
FROM `enderecos`
WHERE `enderecos`.`enderecos_id` IN (2)
SELECT *
FROM `cidades`
---
    public function edit($id)
    {
        $data['enderecos'] = $this->enderecos->find(['enderecos_id' => (int) $id])[0];
        $data['title'] = 'Enderecos';
        $data['form'] = 'Alterar';
        $data['op'] = 'update';
        $data['status'] = [
            ['id' => 0, 'status' => "Principal"],
            ['id' => 1, 'status' => "Secundário"]
        ];
        $data['cidades'] = $this->cidades->findAll();

UPDATE `enderecos` SET `enderecos_rua` = 'Av. Caraíba', `enderecos_numero` = '123', `enderecos_complemento` = 'Q E L 21', `enderecos_cep` = '76350-000', `enderecos_status` = '0', `enderecos_usuarios_id` = '1', `enderecos_cidades_id` = '1'
WHERE `enderecos`.`enderecos_id` IN ('2')
SELECT *
FROM `enderecos`
---
    public function update()
    {
        $dataForm = [
            'enderecos_rua' => $_REQUEST['enderecos_rua'],
            'enderecos_numero' => $_REQUEST['enderecos_numero'],
            'enderecos_complemento' => $_REQUEST['enderecos_complemento'],
            'enderecos_cep' => $_REQUEST['enderecos_cep'],
            'enderecos_status' => $_REQUEST['enderecos_status'],
            'enderecos_usuarios_id' => $_REQUEST['enderecos_usuarios_id'],
            'enderecos_cidades_id' => $_REQUEST['enderecos_cidades_id']
        ];

        $this->enderecos->update($_REQUEST['enderecos_id'], $dataForm);
        $data['msg'] = msg('Alterado com Sucesso!','success');
        $data['enderecos'] = $this->enderecos->findAll();

SELECT *
FROM `enderecos`
WHERE `enderecos_rua` LIKE '%a%' ESCAPE '!'
OR  `enderecos_numero` LIKE '%a%' ESCAPE '!'
---
    public function search()
    {
        //$data['enderecos'] = $this->enderecos->like('enderecos_rua', $_REQUEST['pesquisar'])->find();
        $data['enderecos'] = $this->enderecos->like('enderecos_rua', $_REQUEST['pesquisar'])->orlike('enderecos_numero', $_REQUEST['pesquisar'])->find();