www/codeigniter4/app/Controllers/Estoques.php

    public function index()
    {
        $data['title'] = 'Estoque';
        $data['estoques'] = $this->estoque
            ->select('estoques.*, produtos.produtos_nome')
            ->join('produtos', 'produtos.produtos_id = estoques.estoques_produtos_id')
            ->findAll();
---
SELECT `estoques`.*, `produtos`.`produtos_nome`
FROM `estoques`
JOIN `produtos` ON `produtos`.`produtos_id` = `estoques`.`estoques_produtos_id`