www/codeigniter4/app/Controllers/Funcionarios.php

SELECT `funcionarios`.*, `usuarios`.`usuarios_nome`, `usuarios`.`usuarios_sobrenome`, `usuarios`.`usuarios_cpf`
FROM `funcionarios`
JOIN `usuarios` ON `funcionarios`.`funcionarios_usuarios_id` = `usuarios`.`usuarios_id`
---
    public function index(): string
    {
        $data['title'] = 'Funcionários';
        $data['funcionarios'] = $this->funcionarios
            ->select('funcionarios.*, usuarios.usuarios_nome, usuarios.usuarios_sobrenome, usuarios.usuarios_cpf')
            ->join('usuarios', 'funcionarios.funcionarios_usuarios_id = usuarios.usuarios_id')
            ->findAll();