www/codeigniter4/app/Controllers/Imgprodutos.php

    public function index(): string
    {
        $data['title'] = 'Imgprodutos';
        $data['imgprodutos'] = $this->imgprodutos->findAll();
---
SELECT *
FROM `imgprodutos`
WHERE `imgprodutos`.`deleted_at` IS NULL