www/codeigniter4/app/Controllers/Login.php

    public function logar()
    {
        $login = $_REQUEST['login'];
        $senha = md5($_REQUEST['senha']);

        $this->data['usuarios'] = $this->usuarios->where('usuarios_cpf',$login)->
        orWhere('usuarios_email',$login)->where('usuarios_senha',$senha)->find();
---
SELECT *
FROM `usuarios`
WHERE `usuarios_cpf` = 'luis@gmail.com'
OR `usuarios_email` = 'luis@gmail.com'
AND `usuarios_senha` = 'e10adc3949ba59abbe56e057f20f883e'
AND `usuarios`.`deleted_at` IS NULL