www/codeigniter4/app/Controllers/Produtos.php

SELECT *
FROM `produtos`
JOIN `categorias` ON `produtos_categorias_id` = `categorias_id`
WHERE `produtos`.`deleted_at` IS NULL
---
    public function index(): string
    {
        $data['title'] = 'Produtos';
        $data['produtos'] = $this->produtos->join('categorias', 'produtos_categorias_id = categorias_id')->find();