www/codeigniter4/app/Controllers/Usuarios.php

    public function index(): string
    {
        $data['title'] = 'Usuarios';
        $data['usuarios'] = $this->usuarios->findAll();
---
SELECT *
FROM `usuarios`
WHERE `usuarios`.`deleted_at` IS NULL

    public function edit_nivel(): string
    {
        $data['nivel'] = [
            ['id' => 0, 'nivel' => "Usuário"],
            ['id' => 1, 'nivel' => "Administrador"],
            ['id' => 2, 'nivel' => "Supervisor"]
        ];

        $data['usuarios'] = $this->usuarios->findAll();
        $data['title'] = 'Usuarios';


        $data['usuarios'] = $this->usuarios->findAll();
---
SELECT *
FROM `usuarios`
WHERE `usuarios`.`deleted_at` IS NULL